In [ ]:
##pip install mysql-connector-python

In [1]:
import mysql.connector
from mysql.connector import Error



def create_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password,
            database = db_name
        )
        print("Connection to MySQL DB successful")
    except Error as e:
        print(f"The error '{e}' occurred")

    return connection

In [2]:
host_name = 'database-1moh.cb5jfdq4x6wz.us-east-2.rds.amazonaws.com'
user_name = 'admin'
user_password = 'Amazon#1232'
db_name = 'emp'

connection = create_connection(host_name, user_name, user_password, db_name)

Connection to MySQL DB successful

In [3]:
def execute_query(connection,query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        res = cursor.fetchall()
        return res
    except Error as e:
        print("Errorrrrr occured:", e)

In [4]:
query = "select * from emp"

re = execute_query(connection,query)

In [5]:
print(re)

[('mohan', Decimal('30000')), ('ravi', Decimal('35000')), ('ankit', Decimal('25000'))]

In [6]:
import pandas as pd

In [7]:
# directly reading it in a dataframe

df = pd.read_sql("select * from emp", con = connection)

In [8]:
df.head()

  emp_name  emp_salary
0    mohan     30000.0
1     ravi     35000.0
2    ankit     25000.0